[
  {
    "topic": "Geography of the Arabian Peninsula",
    "content": "The Arabian Peninsula is enclosed by the Red Sea, the Arabian Gulf, the Arabian Sea, and the borders of Syria and Iraq. Its interior consists mostly of deserts and sandy terrain, which historically protected it from foreign invasion. Its strategic location made it a central hub for trade, culture, and religion between the old worlds.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Classification of Arab Tribes",
    "content": "Arab lineages are categorized into three groups: Perishing Arabs (ancient tribes like 'Ad and Thamud), Pure Arabs (Qahtanians originally from Yemen), and Arabized Arabs (Adnanians descended from Ishmael). The Pure Arabs consisted largely of the Himyar and Kahlan tribes.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Migration of Kahlan Septs",
    "content": "The Kahlan septs of the Pure Arabs migrated from Yemen due to the failure of trade under Roman pressure and the bursting of the Ma'rib Dam. They dispersed throughout the peninsula, establishing the Ghassanid kingdom in Syria, the Lakhm kingdom in Heerah, and the tribes of Aws and Khazraj in Madinah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Settlement of Ishmael in Makkah",
    "content": "Abraham left his wife Hagar and infant son Ishmael in the barren valley of Makkah near the Zamzam well. The Yemeni tribe of Jurhum later settled in Makkah with Hagar's permission. Ishmael learned Arabic from the Jurhum tribe and married a woman from among them.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Construction of Al-Ka'bah",
    "content": "Abraham visited Makkah multiple times; during one visit, he and his son Ishmael built the Ka'bah and raised its pillars. Following its construction, Abraham obeyed Allah's command to call mankind to perform pilgrimage to the Sacred House.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "The Nabetean Civilization",
    "content": "The Nabeteans, descendants of Ishmael's son Nabet, established a powerful civilization in northern Hijaz with Petra as their capital. They dominated neighboring tribes until the Romans conquered their kingdom. Some research suggests the Ghassanids, Aws, and Khazraj may have had Nabetean origins.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Lineage of Prophet Muhammad",
    "content": "The Prophet's lineage is traced back to Adnan, a descendant of Ishmael, through the tribes of Mudar, Kinana, and Quraish. Specifically, he descended from the clan of Hashim. The Prophet affirmed that Allah selected him from the best of tribes and families.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Kingdom of Sheba",
    "content": "The Sheba civilization in Yemen dates back to 25 centuries B.C. and flourished through trade and the construction of the Ma'rib Dam. Their rulers were initially called 'Makrib Sheba' before assuming the title 'Kings of Sheba' around 650 B.C., with capitals at Sarwah and later Ma'rib.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "The People of the Ditch",
    "content": "In 523 A.D., Dhu Nawas, a Jewish ruler of Yemen, persecuted the Christians of Najran to force their conversion to Judaism. When they refused, they were thrown into burning ditches. This massacre provoked the Roman emperor to support an Abyssinian invasion of Yemen.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Abyssinian and Persian Rule in Yemen",
    "content": "Following the persecution of Christians, Abyssinians occupied Yemen, leading to the rule of Abraha, who later attempted to destroy the Ka'bah. The Yemenis eventually sought Persian aid to expel the Abyssinians, resulting in Yemen becoming a Persian colony until its governor, Badhan, embraced Islam in 638 A.D.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Migration of the Azd Tribe",
    "content": "The Azd tribe, led by 'Imran bin 'Amr, migrated from Yemen and split into several groups. Tha'labah bin 'Amr settled in Madinah (ancestors of Aws and Khazraj), Haritha bin 'Amr (Khuza'a) took control of Makkah, and the Ghassanids established a kingdom in Syria.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Abraham's Journey to Egypt",
    "content": "During his travels, Abraham went to Egypt where the Pharaoh attempted to harm his wife Sarah. Allah protected her, and the Pharaoh, acknowledging her status, gave his daughter Hagar to Sarah as a servant, whom Sarah later gave to Abraham as a wife.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Sacrifice of Ishmael",
    "content": "Abraham had a vision that he was sacrificing his son Ishmael. Both submitted to Allah's will, and Allah ransomed Ishmael with a great sacrifice. Historical context suggests this event occurred before the birth of Isaac, as Ishmael was thirteen years older.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Descendants of Ishmael",
    "content": "Ishmael had twelve sons, including Nabet and Qidar, who formed tribes trading between Yemen, Syria, and Egypt. While most tribes faded into obscurity, the descendants of Nabet and Qidar survived, with the latter being the ancestors of the 'Adnanian Arabs.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Tribal Divisions of Nizar",
    "content": "Nizar, the son of Ma'ad, had four sons who originated major tribes: Eyad, Anmar, Rabi'a, and Mudar. The Mudar tribe further split into Qais 'Ailan and Elias, tracing down to Kinana and eventually the Quraish.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Unification of Quraish",
    "content": "The Quraish tribes lived scattered in and around Makkah until Qusai bin Kilab united them. He rallied their ranks, established their prominence, and secured honourable status for the tribe within the region.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Ma'rib Dam and the Great Flood",
    "content": "The Ma'rib Dam was a cornerstone of Yemeni civilization. Its eventual collapse caused the Great Flood (Sail Al-'Arim) around 450-451 A.D., referenced in the Qur'an, which led to the fall of the civilization and the dispersal of its people.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Himyarite Kingdom Shifts",
    "content": "Between 115 B.C. and 300 A.D., the Himyar tribe conquered the Kingdom of Sheba and moved the capital from Ma'rib to Redan (later called Zifar). This period marked a decline due to Roman dominance over trade routes and internal tribal warfare.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Expedition of the Elephant",
    "content": "Abraha, the Abyssinian ruler of Yemen, constructed a large army to demolish the Ka'bah in Makkah. He and his forces became known as the 'Men of the Elephant,' an event that failed but became a significant historical marker.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Geographical Distribution of Adnanian Tribes",
    "content": "As the Adnanian tribes expanded, they settled across Arabia: Banu Hanifa in Yamama, Banu Tamim in the Basra semi-desert, Thaqif in Ta'if, and Banu Saleem near Madinah. This distribution covered vast areas from Bahrain to the borders of Iraq.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Persian Influence in Yemen",
    "content": "After the 'Elephant' incident, the Yemenis sought help from Persia to expel the Abyssinians. This led to Yemen becoming a Persian colony governed by appointees of the Persian King Kisra, ending with the governor Badhan embracing Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Categories of Pre-Islamic Rulers",
    "content": "Rulers in pre-Islamic Arabia were divided into two categories: crowned kings and heads of tribes. The crowned kings were not entirely independent and ruled in Yemen, Heerah, and Ghassan. Heads of tribes and clans, however, enjoyed similar privileges to kings and were mostly independent, though some owed allegiance to the crowned rulers.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Abraham's Visits and the Metaphor of the Doorstep",
    "content": "Abraham visited Ishmael in Makkah after Ishmael's marriage. During the first visit, Ishmael's wife complained of poverty, so Abraham left a message to 'change his doorstep,' instructing Ishmael to divorce her. On a subsequent visit, he found a new wife who was grateful to Allah; Abraham instructed Ishmael to 'keep his doorstep,' approving of the marriage.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Migration of the Kinda Tribe",
    "content": "The Kinda tribe, a sept of Kahlan, initially dwelt in Bahrain but were expelled to Hadramout and Najd. In Najd, they established a powerful government, but their dominance was short-lived, and the tribe eventually faded away.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Genealogy Debate Beyond Adnan",
    "content": "While Adnan is confirmed as the twenty-first grandfather of the Prophet, genealogists differ on the lineage between Adnan and Abraham. The Prophet often stopped his lineage at Adnan, stating 'Genealogists tell lies,' though some scholars argue there are exactly forty generations between them.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Divisions of the Abd Manaf Clan",
    "content": "The tribe of Abd Manaf, a sub-division of Quraish, branched into four distinct families: Abd Shams, Nawfal, Muttalib, and Hashim. It is from the family of Hashim that Allah selected Prophet Muhammad (peace be upon him).",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Revolt of Ma'dikarib bin Saif",
    "content": "After the 'Elephant' incident, Ma'dikarib bin Saif Dhu Yazin Al-Himyari led a revolt against the Abyssinian occupiers in Yemen with Persian assistance. He restored independence and became king but was later assassinated by an Abyssinian servant he kept for protection.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Roman Military Intervention in Yemen",
    "content": "Following the massacre of Christians by Dhu Nawas, the Roman emperor instigated the Abyssinians against the Arab rulers of Yemen. He assembled a large fleet to support the Abyssinian army, which consisted of seventy thousand warriors led by Eriat, resulting in the conquest of Yemen in 525 A.D.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Early Persian Rule in Heerah and Iraq",
    "content": "Persian rule over Iraq and its neighbors began with Cyrus (Korosh) the Great (557–529 B.C.), who united the Persians. This dominance lasted until Alexander the Great defeated the Persian King Dara I in 326 B.C., leading to a period of fragmented rule known as the 'Kings of Sects.'",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Migration of the Quda'a Tribe",
    "content": "The Quda'a tribe, belonging to the Himyar group, emigrated from Yemen alongside other tribes. They eventually settled in the Samawa semi-desert region located on the borders of Iraq.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Jurhum the Second",
    "content": "The tribe known as 'Jurhum the Second' arrived in Makkah after Hagar and Ishmael settled there. According to Sahih Al-Bukhari, they arrived before Ishmael reached adulthood, having passed through the valley previously. They were instrumental in Ishmael's upbringing and integration into Arab culture.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Geographical Location of the Arabian Peninsula",
    "content": "The Arabian Peninsula is bounded by the Red Sea and Sinai to the west, the Arabian Gulf to the east, the Arabian Sea to the south, and Syria and Iraq to the north. Its area is estimated between one and one and a quarter million square miles. The interior consists largely of deserts and sandy regions, which made it inaccessible to foreign invaders and preserved the independence of its inhabitants. Due to its external position, it served as a central hub connecting sea and land routes between major civilizations. This strategic location made Arabia a center of trade, culture, religion, and art in the ancient world.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Meaning and Origin of the Term Arab",
    "content": "Linguistically, the word 'Arab' refers to desert and barren land that is nearly waterless and treeless. From early history, both the Arabian Peninsula and its people were described using this term. The designation reflects the harsh environmental conditions in which Arab society developed. These conditions strongly influenced Arab independence, tribal organization, and resilience.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Classification of Arab Tribes by Lineage",
    "content": "Arab tribes were divided into three major groups based on lineage. The first group was the Perishing Arabs, such as ‘Ad, Thamud, Tasam, Jadis, and others, whose histories are largely unknown. The second group was the Pure Arabs, also called Qahtanian Arabs, descended from Ya‘rub bin Yashjub bin Qahtan. The third group was the Arabized Arabs, known as ‘Adnanian Arabs, descended from Ishmael, the son of Prophet Abraham.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Qahtanian Arabs and Their Major Branches",
    "content": "The Qahtanian Arabs originally lived in Yemen and were divided mainly into Himyar and Kahlan. Himyar included well-known branches such as Zaid Al-Jamhur, Quda‘a, and Sakasic. Kahlan included tribes such as Hamdan, Anmar, Tai’, Mudhhij, Kinda, Lakhm, Judham, Azd, Aws, Khazraj, and the Ghassanide kings of Syria. Competition between Himyar and Kahlan eventually led to the migration of many Kahlan tribes out of Yemen.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Migration of Kahlan Tribes from Yemen",
    "content": "The Kahlan tribes migrated from Yemen due to the collapse of trade and Roman control over key routes, as well as the Great Flood caused by the collapse of the Ma’rib Dam. These migrations occurred prior to the flood known as Sail Al-‘Arim. The emigrating Kahlan tribes spread across Hijaz, Madinah, Makkah, Oman, Bahrain, Najd, and Syria. This dispersion reshaped the tribal map of Arabia.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "The Azd Tribe and Its Subgroups",
    "content": "The Azd tribe migrated from Yemen under the leadership of ‘Imran bin ‘Amr Muzaiqiya. Subgroups of Azd settled in various regions, including Madinah, where Aws and Khazraj emerged, and Makkah, where Khuza‘a later took control. Other Azd groups settled in Oman and Tihama, becoming known as Azd of Shanu’a. Another branch established the Ghassanide kingdom in Syria.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Arabized Arabs and the Lineage of Ishmael",
    "content": "The Arabized Arabs trace their ancestry to Prophet Abraham through his son Ishmael. Ishmael and his mother Hagar were settled in the barren valley of Makkah by divine command. The miracle of Zamzam sustained them, leading to the settlement of the Jurhum tribe in Makkah. Ishmael later married into Jurhum and became the patriarch of Arabized Arabs.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Construction of the Ka‘bah by Abraham and Ishmael",
    "content": "Prophet Abraham visited Makkah multiple times to see his son Ishmael. On one of these visits, Abraham and Ishmael jointly rebuilt the Ka‘bah and raised its foundations. Abraham was then commanded to call humanity to pilgrimage. This event established Makkah as a religious center long before Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Descendants of Ishmael and Emergence of Adnan",
    "content": "Ishmael had twelve sons who formed tribes that settled in and around Makkah and engaged in regional trade. Over time, most of these lineages faded except for the descendants of Nabet and Qidar. From Qidar descended ‘Adnan, who is considered the common ancestor of the Adnanian Arabs. Prophet Muhammad traced his lineage to ‘Adnan and did not go beyond him in genealogical narration.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "The Tribe of Quraish and Its Lineage",
    "content": "Quraish descended from Kinana bin Khuzaimah through Fahr bin Malik. The tribe later branched into prominent clans such as Jumah, Sahm, ‘Adi, Makhzum, Tayim, Zahra, and the descendants of Qusai bin Kilab. From the clan of Hashim, son of ‘Abd Manaf, came Prophet Muhammad. The selection of Hashim’s lineage is described as a divine choice.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Types of Rulership Among Pre-Islamic Arabs",
    "content": "Before Islam, Arab rulers fell into two categories: crowned kings and tribal chiefs. Crowned kings ruled in Yemen, Heerah, and Ghassan, but lacked full independence. Tribal chiefs elsewhere exercised authority similar to kings and enjoyed significant autonomy. Many tribes were entirely independent and governed by customary tribal leadership.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Rulership in Yemen Before Islam",
    "content": "Yemen was ruled by successive dynasties, beginning with the kings of Sheba, then Himyar. The Ma’rib Dam played a central role in Yemeni civilization until its collapse around the fifth century A.D. Yemen experienced Abyssinian occupation, followed by Persian control. Persian rule ended when Badhan, the last Persian governor, embraced Islam in 638 A.D.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "The People of the Elephant",
    "content": "Abraha, the Abyssinian ruler of Yemen, attempted to demolish the Ka‘bah using an army that included elephants. This event became known as the incident of the People of the Elephant. The campaign ended in divine destruction of Abraha’s army. This incident occurred shortly before the birth of Prophet Muhammad.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Rulership in Heerah Under Persian Influence",
    "content": "Heerah was ruled by Arab kings under Persian overlordship, particularly the Lakhmid dynasty. Persian kings appointed and dismissed rulers of Heerah to secure their borders against Byzantines and Arab tribes. The famous Battle of Dhi Qar marked the first major Arab victory over the Persians. This battle occurred shortly after the birth of Prophet Muhammad.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Rulership in Hijaz and Control of Makkah",
    "content": "Control of Makkah passed from Ishmael’s descendants to Jurhum, then to Khuza‘a, and finally to Quraish under Qusai bin Kilab around 440 A.D. Qusai unified Quraish, established the House of An-Nadwah, and organized political and religious offices. He secured full custodianship of the Ka‘bah for Quraish. His reforms laid the foundations of Makkah’s leadership structure.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Political Institutions Established by Qusai bin Kilab",
    "content": "Qusai established An-Nadwah House as a council for decision-making, war declarations, and marriage contracts. He organized responsibilities such as providing food and water to pilgrims, guarding the Ka‘bah, and leading military efforts. Various Qurayshi clans were assigned administrative and ceremonial roles. These institutions functioned as an early form of organized governance in Makkah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Religious State of Arabs Before Islam",
    "content": "Most Arabs originally followed the monotheistic religion of Abraham and Ishmael. Over time, essential beliefs remained but practices were corrupted. The introduction of idol worship marked a major deviation from monotheism. Despite this, some Abrahamic rituals like pilgrimage and circumambulation of the Ka‘bah persisted.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Introduction of Idol Worship by ‘Amr bin Luhai",
    "content": "‘Amr bin Luhai, a leader of Khuza‘a, introduced idol worship into Arabia after observing it in Syria. He brought the idol Hubal to Makkah and placed it inside the Ka‘bah. Idol worship spread throughout Hijaz due to Makkah’s religious influence. This marked the formal establishment of polytheism in Arabia.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Major Pre-Islamic Arabian Idols",
    "content": "Prominent idols included Hubal in Makkah, Al-Lat in Ta’if, Al-‘Uzza in Nakhlah, and Manat near Qadid. Every tribe and household maintained its own idols. By the time of the Prophet’s conquest of Makkah, 360 idols surrounded the Ka‘bah. These idols were destroyed under the Prophet’s command.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Superstitions and Divination Practices of Pre-Islamic Arabs",
    "content": "Pre-Islamic Arabs practiced divination using Azlam arrows to decide major matters like marriage and travel. They believed in omens, astrology, soothsayers, and the influence of stars. Certain animals, days, and directions were considered either auspicious or ominous. These beliefs reflected widespread superstition and fatalism.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Presence of Judaism in Arabia",
    "content": "Jewish migration into Arabia occurred in two major waves, following Babylonian and Roman persecutions. Jewish tribes settled in regions such as Yathrib, Khaibar, and Taima’. They built forts, engaged in agriculture, and played an important political role. Several prominent Jewish tribes existed at the advent of Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Social Structure of Pre-Islamic Arabian Society",
    "content": "Pre-Islamic Arabian society was primarily tribal, with loyalty to the clan overriding all other affiliations. Tribal honor, protection, and collective responsibility were central values. An individual’s safety and social standing depended entirely on tribal membership. Inter-tribal conflicts were common and often lasted generations due to revenge customs. Justice was administered through tribal customs rather than centralized law.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Economic Life of the Arabs Before Islam",
    "content": "The economy of pre-Islamic Arabia relied on trade, pastoralism, and limited agriculture. Makkah emerged as a major commercial hub due to its location on trade routes linking Yemen, Syria, and Iraq. Seasonal trade caravans to Yemen in winter and Syria in summer were vital to Quraysh prosperity. Markets such as ‘Ukaz, Majannah, and Dhul-Majaz played important economic and cultural roles.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Moral Conditions in Pre-Islamic Arabia",
    "content": "Moral life in pre-Islamic Arabia was marked by contradictions. While bravery, generosity, hospitality, and loyalty were admired virtues, vices such as alcoholism, gambling, usury, and sexual immorality were widespread. Female infanticide existed among some tribes due to fear of poverty or dishonor. The absence of a moral code rooted in accountability to God contributed to social injustice.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Status of Women in Pre-Islamic Arabia",
    "content": "Women in pre-Islamic Arabia generally lacked legal rights and were often treated as property. Inheritance rights were denied, and forced marriages were common. Some tribes practiced burying infant girls alive. Despite this, a few women of noble families, such as Khadijah bint Khuwaylid, enjoyed economic independence and social respect.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Political Fragmentation of Arabia Before Islam",
    "content": "Arabia lacked a unified political authority prior to Islam. Most regions were governed by autonomous tribes, while border areas were influenced by Persian or Byzantine powers. This fragmentation resulted in constant warfare and instability. No single leader or institution existed to unify the Arabs under a common cause.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Religious Pluralism in Pre-Islamic Arabia",
    "content": "In addition to paganism, Arabia hosted several religious communities. Judaism was prominent in Yathrib, Khaibar, and Taima’. Christianity existed among the Ghassanids, in Najran, and parts of Yemen. Zoroastrianism appeared in eastern Arabia under Persian influence. Sabian beliefs were also present among small groups.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Hanifs and the Search for Monotheism",
    "content": "A small number of Arabs rejected idol worship and sought to follow the pure monotheism of Abraham. These individuals were known as Hanifs. They avoided pagan rituals and searched for true guidance independently. Though few in number, their presence indicated dissatisfaction with prevailing religious practices.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Lineage of Prophet Muhammad",
    "content": "Prophet Muhammad belonged to the clan of Hashim from the tribe of Quraysh. His lineage traces back through ‘Abd al-Muttalib, Hashim, ‘Abd Manaf, Qusai, and ultimately to ‘Adnan. This lineage was widely respected among the Arabs. The Prophet emphasized that God selected him from the noblest line among mankind.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Birth of Prophet Muhammad",
    "content": "Prophet Muhammad was born in Makkah in the Year of the Elephant. His father, ‘Abdullah, had passed away before his birth. He was born into the household of Banu Hashim and was named Muhammad by his grandfather ‘Abd al-Muttalib. His birth occurred during a period of moral and religious decline in Arabia.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Early Orphanhood of the Prophet",
    "content": "The Prophet lost his mother, Aminah bint Wahb, at a young age while returning from Yathrib. After her death, his grandfather ‘Abd al-Muttalib took care of him. Upon the grandfather’s death, guardianship passed to his uncle Abu Talib. These early losses shaped the Prophet’s compassion and resilience.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "The Prophet’s Time with Banu Sa‘d",
    "content": "As was customary among Quraysh, Prophet Muhammad was sent to live with a wet nurse from the desert, Halimah al-Sa‘diyyah. During his stay, Halimah’s household experienced increased blessings. The Prophet developed physical strength, eloquence, and moral refinement in the desert environment. This upbringing prepared him for leadership.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Incident of the Opening of the Chest",
    "content": "While the Prophet was living with Halimah, angels purified his heart by removing a portion associated with human weakness. This incident caused fear among those present. Halimah returned him to his mother shortly afterward. The event symbolized divine preparation for prophethood.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "The Prophet’s Reputation as Al-Amin",
    "content": "Before prophethood, Muhammad was widely known as Al-Amin, the Trustworthy. The people of Makkah entrusted him with their valuables and disputes. His honesty, truthfulness, and reliability distinguished him from his peers. This reputation later strengthened the credibility of his message.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Participation in Hilf al-Fudul",
    "content": "The Prophet participated in the alliance known as Hilf al-Fudul, which aimed to uphold justice and protect the oppressed. This pact was formed after a merchant was wronged in Makkah. The Prophet later stated that he would support such a pact even after Islam. This highlights his early commitment to justice.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Marriage to Khadijah bint Khuwaylid",
    "content": "The Prophet married Khadijah, a respected and wealthy businesswoman of Quraysh. She was impressed by his honesty during trade journeys. Their marriage was marked by mutual respect and support. Khadijah later became the first person to believe in his prophethood.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Rebuilding of the Ka‘bah and Arbitration",
    "content": "When the Ka‘bah was rebuilt after flood damage, Quraysh disputed who would place the Black Stone. Muhammad proposed placing it on a cloth and having representatives of each clan lift it together. He then positioned it himself. This solution prevented bloodshed and demonstrated his wisdom.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Spiritual Retreats Before Prophethood",
    "content": "Before receiving revelation, Muhammad regularly withdrew to the Cave of Hira’ for contemplation. He rejected idol worship and sought truth through reflection. These retreats intensified as he approached the age of forty. This period marked spiritual preparation for revelation.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Beginning of Revelation",
    "content": "The first revelation came to Prophet Muhammad in the Cave of Hira’ through the Angel Gabriel. He was commanded to read in the name of his Lord. This event marked the beginning of prophethood and divine guidance. The experience deeply affected him and initiated the mission of Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "First Public Call to Islam",
    "content": "After receiving revelation privately for about three years, Prophet Muhammad was commanded to proclaim Islam openly. He gathered the Quraysh on Mount Safa and warned them of accountability before God. While some listened, his uncle Abu Lahab openly rejected the message. This event marked the beginning of open opposition to Islam in Makkah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Early Converts to Islam",
    "content": "The earliest believers included Khadijah bint Khuwaylid, Ali ibn Abi Talib, Zayd ibn Harithah, and Abu Bakr as-Siddiq. Abu Bakr played a key role in inviting others to Islam, leading to the conversion of prominent companions. Early converts came from various social classes, including slaves and nobles. Their faith formed the foundation of the Muslim community.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Persecution of Muslims in Makkah",
    "content": "As Islam spread, Quraysh intensified persecution against Muslims. Slaves such as Bilal ibn Rabah were tortured to force them to abandon Islam. Social and economic pressure was applied to weaken the new faith. Despite this, Muslims remained steadfast and continued practicing Islam secretly or with patience.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Migration to Abyssinia",
    "content": "To escape persecution, the Prophet permitted some Muslims to migrate to Abyssinia, ruled by the Christian king Negus. Two migrations occurred, with the second being larger. The Negus granted Muslims protection after hearing verses from Surah Maryam. Quraysh failed to persuade him to expel the Muslims.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Quraysh Boycott of Banu Hashim",
    "content": "Quraysh imposed a social and economic boycott on Banu Hashim and Banu Muttalib to isolate the Prophet. The boycott prohibited marriage, trade, and social relations with them. The clans were confined to Shi‘b Abi Talib for about three years. The boycott ended when the pact was found eaten by insects except for God’s name.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Year of Sorrow",
    "content": "The tenth year of prophethood became known as the Year of Sorrow due to the deaths of Khadijah and Abu Talib. Khadijah had been the Prophet’s strongest emotional support, while Abu Talib provided tribal protection. Their deaths exposed the Prophet to increased hostility. This period marked one of the most difficult phases of his life.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Journey to Ta’if",
    "content": "After facing rejection in Makkah, the Prophet traveled to Ta’if seeking support. The leaders of Ta’if rejected him and incited the people to stone him. Injured and distressed, he sought refuge in prayer. Despite the hardship, he refused divine punishment upon Ta’if, hoping their descendants would believe.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Isra and Mi‘raj",
    "content": "The Prophet was taken on a miraculous night journey from Makkah to Jerusalem and then ascended through the heavens. During this journey, he met earlier prophets and was shown signs of divine power. The five daily prayers were prescribed during this event. The journey strengthened the believers and tested the faith of others.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "First Pledge of ‘Aqabah",
    "content": "A group of twelve men from Yathrib met the Prophet secretly during pilgrimage season. They pledged belief in Islam and obedience to moral principles. This pledge marked the beginning of Islam’s spread in Yathrib. Mus‘ab ibn ‘Umayr was sent to teach them Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Second Pledge of ‘Aqabah",
    "content": "The second pledge involved seventy-three men and two women from Yathrib. They pledged to protect the Prophet as they would their own families. This agreement established a political and military alliance. It paved the way for the migration to Madinah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Migration to Madinah",
    "content": "The Prophet migrated from Makkah to Madinah after Quraysh plotted to kill him. Ali ibn Abi Talib slept in his bed to deceive the assassins. The Prophet and Abu Bakr hid in the Cave of Thawr before continuing their journey. This migration marked the beginning of the Islamic calendar.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Establishment of Brotherhood in Madinah",
    "content": "Upon arrival in Madinah, the Prophet established brotherhood between the Muhajirun and Ansar. This system provided social and economic support to migrants. It dissolved tribal barriers and strengthened unity. Brotherhood became a cornerstone of the new Islamic society.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Construction of the Prophet’s Mosque",
    "content": "The Prophet purchased land in Madinah to build a mosque that served as a place of worship and governance. He participated personally in its construction. The mosque functioned as a center for prayer, education, consultation, and community life. It symbolized equality and collective responsibility.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Charter of Madinah",
    "content": "The Prophet drafted a written agreement regulating relations between Muslims, Jews, and other residents of Madinah. The charter defined rights, duties, and mutual defense obligations. It recognized the Prophet as the final authority in disputes. This document established one of the earliest constitutional frameworks in history.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of Badr",
    "content": "The Battle of Badr occurred in the second year after Hijrah between Muslims and Quraysh. Despite being outnumbered, Muslims achieved a decisive victory. Key Qurayshi leaders were killed or captured. The battle strengthened the position of Islam in Arabia.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of Uhud",
    "content": "The Battle of Uhud took place in the third year after Hijrah. Initial Muslim success turned into setback when archers disobeyed orders. The Prophet was injured, and several companions were martyred. The battle taught lessons of discipline and obedience.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of the Trench",
    "content": "During the fifth year after Hijrah, Quraysh and allied tribes besieged Madinah. The Muslims dug a trench as a defensive strategy on the Prophet’s advice. The siege ended without direct combat due to internal discord and severe weather. This battle marked a strategic turning point in favor of Muslims.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Treaty of Hudaybiyyah",
    "content": "The Treaty of Hudaybiyyah was concluded between the Prophet and Quraysh in the sixth year after Hijrah. Though its terms appeared unfavorable, it ensured ten years of peace. The treaty allowed Islam to spread freely. The Qur’an described it as a clear victory.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Conquest of Makkah",
    "content": "In the eighth year after Hijrah, the Prophet entered Makkah peacefully with a large Muslim army. He declared a general amnesty for its inhabitants. Idols in and around the Ka‘bah were destroyed. Makkah was restored as a center of monotheism.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Farewell Pilgrimage",
    "content": "The Prophet performed his only complete pilgrimage in the tenth year after Hijrah. During it, he delivered the Farewell Sermon. He emphasized equality, justice, women’s rights, and adherence to the Qur’an and Sunnah. This sermon summarized the core principles of Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Expedition of Hamzah ibn ‘Abdul-Muttalib",
    "content": "The first military expedition authorized by the Prophet occurred in the first year after Hijrah. Hamzah ibn ‘Abdul-Muttalib was appointed commander of a small detachment to intercept a Qurayshi trade caravan. No fighting took place due to mediation by a neutral party. This expedition marked the beginning of organized Muslim military activity.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Expedition of ‘Ubaydah ibn al-Harith",
    "content": "‘Ubaydah ibn al-Harith led a group of Muslims to Rabigh to confront a Qurayshi force. The encounter resulted only in an exchange of arrows without full combat. Two Qurayshi men defected to the Muslim side. This event demonstrated growing tension between Muslims and Quraysh.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Expedition of Sa‘d ibn Abi Waqqas",
    "content": "Sa‘d ibn Abi Waqqas commanded a reconnaissance mission to Kharrar. The Qurayshi caravan had already passed before the Muslims arrived. No confrontation occurred. These early expeditions aimed to assert Muslim presence and monitor Qurayshi movements.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Change of Qiblah",
    "content": "Originally, Muslims prayed facing Jerusalem. In the second year after Hijrah, revelation commanded the change of prayer direction toward the Ka‘bah in Makkah. This occurred during congregational prayer in a mosque later called Masjid al-Qiblatayn. The change affirmed the distinct identity of the Muslim community.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Legislation of Fasting in Ramadan",
    "content": "Fasting during the month of Ramadan was prescribed in the second year after Hijrah. It became an obligatory act of worship for adult Muslims. This legislation aimed to cultivate piety, self-discipline, and social empathy. Ramadan soon became a central pillar of Islamic practice.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Legislation of Zakat",
    "content": "Zakat was formally regulated in Madinah as a compulsory charity. Specific rates and categories of wealth were defined. Zakat functioned as a social welfare system to support the poor, debtors, and other vulnerable groups. It strengthened economic solidarity among Muslims.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of Banu Qaynuqa‘",
    "content": "Banu Qaynuqa‘ violated the Charter of Madinah after provoking hostility against Muslims. Following the Battle of Badr, their misconduct escalated into open confrontation. The Prophet besieged their strongholds until they surrendered. They were expelled from Madinah rather than executed.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of Banu Nadir",
    "content": "Banu Nadir plotted to assassinate the Prophet during a visit. Upon discovery of the plot, they were ordered to leave Madinah. When they resisted, their fortresses were besieged. They were eventually expelled and relocated mainly to Khaybar.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of Banu Qurayzah",
    "content": "During the Battle of the Trench, Banu Qurayzah violated their treaty with the Muslims. After the confederate forces withdrew, the Prophet laid siege to their fortresses. Judgment was passed according to Jewish law by Sa‘d ibn Mu‘adh. The verdict addressed the breach of wartime treason.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Expedition to Dumat al-Jandal",
    "content": "The Prophet led an expedition to Dumat al-Jandal to confront reports of banditry and potential Byzantine threats. Upon arrival, hostile forces dispersed. The expedition demonstrated the growing reach and authority of the Muslim state. It also secured northern trade routes.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of Khaybar",
    "content": "The Battle of Khaybar occurred in the seventh year after Hijrah against fortified Jewish settlements. The Muslims achieved victory after a prolonged siege. ‘Ali ibn Abi Talib played a decisive role in capturing key fortresses. The land was retained under Muslim authority with agricultural arrangements.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Marriage to Safiyyah bint Huyayy",
    "content": "After the Battle of Khaybar, the Prophet married Safiyyah bint Huyayy. She was freed prior to marriage. The union helped reconcile tensions and demonstrated humane treatment of former enemies. She later became one of the Mothers of the Believers.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Letters to Kings and Rulers",
    "content": "After Hudaybiyyah, the Prophet sent letters inviting regional rulers to Islam. Recipients included the Byzantine emperor Heraclius, the Persian ruler Chosroes, the Negus of Abyssinia, and the ruler of Egypt. Responses varied from respectful consideration to outright hostility. These letters signaled Islam’s universal mission.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of Mu’tah",
    "content": "The Battle of Mu’tah occurred in response to the killing of a Muslim envoy. The Muslim force faced a much larger Byzantine army. Three successive commanders were martyred before Khalid ibn al-Walid assumed command. He successfully withdrew the army, earning the title “Sword of Allah.”",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of Hunayn",
    "content": "The Battle of Hunayn took place shortly after the Conquest of Makkah. Muslims initially retreated due to an ambush by Hawazin and Thaqif. The Prophet remained steadfast and rallied the army. Victory was eventually secured, teaching lessons about reliance on God rather than numbers.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Siege of Ta’if",
    "content": "Following Hunayn, Muslims laid siege to Ta’if. The city resisted strongly, and the siege was eventually lifted. The Prophet chose restraint rather than force. Ta’if later embraced Islam voluntarily.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Battle of Tabuk",
    "content": "The Battle of Tabuk occurred in the ninth year after Hijrah against a potential Byzantine threat. Despite severe heat and scarcity, the Muslims marched north. No direct battle took place as the enemy withdrew. The expedition exposed hypocrites and strengthened Muslim influence in the region.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Year of Delegations",
    "content": "The ninth year after Hijrah became known as the Year of Delegations. Tribes from across Arabia came to Madinah to declare Islam. These delegations accepted Islamic governance and teachings. This period marked widespread acceptance of Islam throughout Arabia.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Destruction of Idols Across Arabia",
    "content": "After the consolidation of Islam, the Prophet sent companions to destroy major idols. Khalid ibn al-Walid destroyed Al-‘Uzza, and Sa‘d ibn Zayd destroyed Manat. ‘Amr ibn al-‘As destroyed Suwa‘. These actions ended organized idol worship in Arabia.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Illness and Passing of the Prophet",
    "content": "The Prophet fell ill shortly after returning from the Farewell Pilgrimage. He continued to lead and advise the community as long as possible. He passed away in Madinah in the eleventh year after Hijrah. His death marked the completion of the prophetic mission.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Name and Titles of Prophet Muhammad",
    "content": "The Prophet was named Muhammad at birth by his grandfather ‘Abd al-Muttalib. Among his well-known titles were Ahmad, Al-Mahi, Al-Hashir, and Al-‘Aqib. Before prophethood, he was widely known as Al-Amin due to his trustworthiness. These names and titles reflected his moral character and prophetic mission.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Foster Brothers of the Prophet",
    "content": "During his stay with Halimah al-Sa‘diyyah, the Prophet had foster siblings. Among them were ‘Abdullah ibn al-Harith and Shayma’. Shayma’ later embraced Islam and was treated with honor by the Prophet. These foster relationships were respected in Arab custom.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Death of ‘Abdullah ibn ‘Abd al-Muttalib",
    "content": "The Prophet’s father, ‘Abdullah, died while returning from a trade journey to Syria. He passed away in Yathrib and was buried there. His death occurred before the Prophet’s birth. This left the Prophet born an orphan.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Visit to Yathrib with Aminah",
    "content": "Aminah bint Wahb traveled with her son Muhammad to Yathrib to visit his father’s grave. They stayed with relatives from Banu Najjar. On the return journey, Aminah fell ill and died at Abwa’. The Prophet was six years old at the time.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Umm Ayman",
    "content": "Umm Ayman, whose name was Barakah, served as the Prophet’s caretaker after his mother’s death. She remained close to him throughout his life. The Prophet regarded her as part of his family. She later embraced Islam and migrated to Madinah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Guardianship of Abu Talib",
    "content": "After the death of ‘Abd al-Muttalib, Abu Talib assumed guardianship of the Prophet. Despite financial hardship, he cared for him with dedication. Abu Talib provided protection during the early years of prophethood. His tribal status shielded the Prophet from assassination.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Journey to Syria with Abu Talib",
    "content": "The Prophet accompanied Abu Talib on a trade journey to Syria in his youth. During this journey, a Christian monk named Bahira recognized signs of prophethood in him. Bahira warned Abu Talib to protect the boy from harm. Abu Talib returned him to Makkah for safety.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Participation in Harb al-Fijar",
    "content": "The Prophet witnessed the sacrilegious wars known as Harb al-Fijar during his youth. He did not actively fight but assisted his uncles by collecting arrows. These wars violated the sanctity of the sacred months. The experience exposed him to tribal conflict without moral purpose.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Trade Journey for Khadijah",
    "content": "Khadijah bint Khuwaylid employed Muhammad to lead her trade caravan to Syria. Her servant Maysarah accompanied him and observed his honesty. The journey yielded exceptional profits. Khadijah became impressed by his character and integrity.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Proposal and Marriage to Khadijah",
    "content": "Khadijah proposed marriage to Muhammad through an intermediary. The Prophet accepted, and Abu Talib delivered the marriage sermon. Muhammad was twenty-five years old, and Khadijah was forty. Their marriage lasted twenty-five years without another wife during her lifetime.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Children of the Prophet",
    "content": "The Prophet had six children from Khadijah: Al-Qasim, Zaynab, Ruqayyah, Umm Kulthum, Fatimah, and ‘Abdullah. Al-Qasim and ‘Abdullah died in childhood. All daughters lived to adulthood except that they died before or shortly after the Prophet, except Fatimah. Fatimah was the closest to him.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Beginning of Private Da‘wah",
    "content": "After the first revelation, the Prophet invited people to Islam privately. This phase lasted approximately three years. Early converts included family members and close friends. Secrecy protected the fragile Muslim community.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "House of Al-Arqam",
    "content": "The Prophet used the house of Al-Arqam ibn Abi Al-Arqam as a center for teaching Islam. It was located near Mount Safa. Muslims gathered there secretly to learn Qur’an and prayer. This house played a critical role in early Islamic education.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Conversion of Hamzah ibn ‘Abdul-Muttalib",
    "content": "Hamzah embraced Islam after learning of Abu Jahl’s insult to the Prophet. His conversion strengthened the Muslim position. Hamzah openly declared his faith. Quraysh became more cautious afterward.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Conversion of ‘Umar ibn al-Khattab",
    "content": "‘Umar accepted Islam after reading verses from Surah Ta-Ha in his sister’s house. His conversion marked a turning point. Muslims began praying openly near the Ka‘bah. Quraysh influence was challenged more directly.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Mockery and Accusations by Quraysh",
    "content": "Quraysh accused the Prophet of sorcery, poetry, and madness. They attempted to discredit the Qur’an. Despite this, many recognized his truthfulness. These accusations failed to halt the spread of Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Negotiations and Compromise Attempts",
    "content": "Quraysh proposed wealth, leadership, and marriage to stop the Prophet’s mission. The Prophet firmly rejected all compromises. He declared that he would not abandon his message even if given the sun and moon. This demonstrated unwavering commitment.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Deaths During Makkan Persecution",
    "content": "Sumayyah bint Khayyat became the first martyr in Islam. She was killed for refusing to abandon her faith. Her husband Yasir also died due to persecution. Their deaths exemplified early Muslim sacrifice.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Abu Bakr in Early Islam",
    "content": "Abu Bakr supported Islam financially and socially. He freed several enslaved Muslims, including Bilal. His influence led to many conversions. He remained a constant supporter of the Prophet.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Return of Abyssinian Migrants",
    "content": "Some migrants returned from Abyssinia after hearing false reports of Quraysh acceptance of Islam. Persecution resumed upon their return. Many later migrated again. This highlighted the instability in Makkah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Support of the Negus",
    "content": "The Negus secretly embraced Islam according to authentic reports. He protected Muslim refugees throughout his reign. The Prophet later performed funeral prayer for him in absentia. This reflected strong diplomatic ties.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Quraysh Assassination Plot",
    "content": "Quraysh leaders conspired to kill the Prophet collectively. Each clan selected a youth to strike simultaneously. This plan aimed to avoid tribal retaliation. Divine revelation informed the Prophet of the plot.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Ali Sleeping in the Prophet’s Bed",
    "content": "Ali ibn Abi Talib slept in the Prophet’s bed on the night of migration. This act risked his life. Ali later returned entrusted valuables to their owners. His loyalty was exemplary.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Asma’ bint Abi Bakr",
    "content": "Asma’ provided food to the Prophet and Abu Bakr while they hid in the Cave of Thawr. She endured harm from Quraysh without revealing information. She earned the title “Dhat an-Nitaqayn.” Her courage was notable.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Arrival in Quba’",
    "content": "The Prophet first arrived in Quba’ near Madinah. He stayed several days there. He established the Mosque of Quba’, the first mosque in Islam. This marked the start of the Madinan phase.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Camel’s Choice of Mosque Site",
    "content": "The Prophet allowed his camel to choose where to settle in Madinah. The camel knelt on land belonging to two orphan boys. The Prophet purchased the land. It became the site of his mosque.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Ahl as-Suffah",
    "content": "Ahl as-Suffah were poor companions who lived in the Prophet’s mosque. They dedicated themselves to learning Islam. The Prophet personally cared for their needs. Many later became prominent teachers and fighters.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Hypocrites in Madinah",
    "content": "After Islam gained strength, hypocrisy emerged in Madinah. ‘Abdullah ibn Ubayy was a prominent leader among them. Hypocrites outwardly accepted Islam while plotting against it. Qur’anic revelations exposed their behavior.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Marriage to ‘Aishah bint Abi Bakr",
    "content": "The Prophet married ‘Aishah after migration to Madinah. She became a major source of knowledge after his death. Her intelligence and memory preserved many narrations. She played a vital scholarly role.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Legislation of Adhan",
    "content": "The call to prayer was instituted in Madinah. ‘Abdullah ibn Zayd saw it in a dream. ‘Umar ibn al-Khattab confirmed it with a similar dream. Bilal was appointed the first caller to prayer.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Battle of Dhi ‘Amr",
    "content": "The Prophet led an expedition against hostile tribes threatening Madinah. No battle occurred as the enemy dispersed. This expedition asserted Muslim authority. It deterred future attacks.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Marriage to Hafsah bint ‘Umar",
    "content": "The Prophet married Hafsah after her husband died at Badr. This strengthened ties with ‘Umar ibn al-Khattab. Hafsah later preserved early Qur’anic manuscripts. She was among the Mothers of the Believers.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Prohibition of Alcohol",
    "content": "Alcohol was prohibited gradually through revelation. Initial verses discouraged intoxication. Later verses banned it completely. This gradual approach eased social transformation.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Expulsion of Hypocrite Mosque",
    "content": "Some hypocrites built Masjid al-Dirar to cause division. Revelation exposed their intention. The Prophet ordered the mosque destroyed. Unity and sincerity were preserved.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Delegation of Najran Christians",
    "content": "A Christian delegation from Najran debated theology with the Prophet. The event led to the proposal of mutual imprecation. The delegation chose peace and paid jizyah. Relations were regulated peacefully.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Farewell Sermon Themes",
    "content": "The Farewell Sermon emphasized sanctity of life and property. It abolished usury and tribal revenge. Equality of all races was declared. The Prophet affirmed completion of the message.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Final Revelation",
    "content": "Near the end of the Prophet’s life, revelation announced completion of religion. This occurred during the Farewell Pilgrimage. The companions sensed impending departure. The verse marked culmination of Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Last Days of the Prophet",
    "content": "The Prophet spent his final illness in the house of ‘Aishah. He continued advising the community. He emphasized prayer and treatment of dependents. His condition gradually worsened.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Burial of the Prophet",
    "content": "The Prophet was buried in the chamber of ‘Aishah. Companions prayed over him individually. Abu Bakr affirmed his death and steadied the community. Leadership then passed to Abu Bakr.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Genealogical Preservation Among the Arabs",
    "content": "Arabs placed great importance on preserving genealogy and lineage. Tribal identity was maintained through oral transmission of ancestry. This practice ensured social structure and alliances. The lineage of Prophet Muhammad was widely acknowledged and carefully preserved.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Titles of Qurayshi Leadership Before Islam",
    "content": "Before Islam, Quraysh distributed responsibilities among leading clans. These included custodianship of the Ka‘bah, leadership in war, provision of water and food to pilgrims, and consultation authority. Each role carried prestige and influence. These systems later facilitated organized governance in Makkah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Siqayah and Rifadah",
    "content": "Siqayah referred to providing water to pilgrims, while Rifadah involved feeding them. These duties were overseen by the clan of Hashim. They enhanced Quraysh’s religious standing among Arabs. The Prophet inherited this tradition of service.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Pre-Islamic Poetry as Historical Record",
    "content": "Poetry served as a primary means of recording history among Arabs. It preserved accounts of battles, virtues, and lineage. Poets held significant social influence. The Qur’an later challenged this tradition with unmatched eloquence.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Markets in Arabian Society",
    "content": "Seasonal markets such as ‘Ukaz, Majannah, and Dhul-Majaz were centers of trade and culture. They hosted poetry competitions and tribal negotiations. The Prophet attended some of these markets to invite people to Islam. These gatherings facilitated widespread communication.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Initial Revelation Period (Fatrah)",
    "content": "After the first revelation, a temporary pause occurred. This period caused emotional distress to the Prophet. Revelation later resumed with renewed intensity. The pause reinforced the gravity of prophethood.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Early Qur’anic Themes in Makkah",
    "content": "Makkan revelations emphasized monotheism, accountability, and the afterlife. They confronted idol worship and moral corruption. Short, powerful verses characterized this period. These themes prepared hearts for later legislation.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Public Recitation of the Qur’an",
    "content": "Despite persecution, the Prophet recited the Qur’an publicly near the Ka‘bah. Quraysh reacted with hostility and ridicule. Some listeners were deeply affected by its message. Public recitation became a form of da‘wah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Incident of Qur’an Recitation to Quraysh Leaders",
    "content": "The Prophet once recited Qur’anic verses to leaders like Utbah ibn Rabi‘ah. Utbah acknowledged the power of the message. Quraysh debated how to counter its influence. They ultimately resorted to propaganda.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Protection by Tribal Custom",
    "content": "Arab custom prohibited killing a man under tribal protection. Abu Talib’s status protected the Prophet. This custom delayed Quraysh’s plans. The Prophet’s safety depended on this system until Hijrah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Attempt to Seek Support from Arab Tribes",
    "content": "During pilgrimage seasons, the Prophet approached various tribes. He invited them to Islam and requested protection. Most tribes refused due to fear of Quraysh. These efforts eventually led to success with Yathrib.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Mus‘ab ibn ‘Umayr in Madinah",
    "content": "Mus‘ab ibn ‘Umayr was sent to Madinah as the first teacher of Islam. He taught Qur’an and prayer to new converts. His efforts led to widespread acceptance of Islam. Many leaders embraced Islam through him.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Islamization of Aws and Khazraj",
    "content": "The tribes of Aws and Khazraj had long-standing rivalries. Islam united them under shared belief. Their leaders accepted Islam prior to Hijrah. This unity laid the foundation for the Ansar.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Use of Intelligence and Strategy in Hijrah",
    "content": "The Prophet used careful planning during migration. Routes were altered to avoid detection. Trusted individuals handled logistics. This demonstrated reliance on both divine help and strategy.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Treaties with Neighboring Tribes",
    "content": "The Prophet established treaties with tribes around Madinah. These ensured mutual security and neutrality. Such treaties stabilized the region. They reduced the risk of surprise attacks.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Transformation of Tribal Loyalty",
    "content": "Islam redirected loyalty from tribe to faith. Brotherhood replaced blood-based alliances. This transformation was gradual but profound. It reshaped Arabian social order.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Psychological Warfare by Quraysh",
    "content": "Quraysh spread rumors to discourage acceptance of Islam. They warned tribes against listening to the Prophet. They attempted to isolate him socially. These efforts largely failed.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Prisoners of Badr",
    "content": "After Badr, prisoners were treated humanely. Some were released for ransom. Others earned freedom by teaching literacy. This established ethical standards in warfare.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Marriage to Zaynab bint Khuzaymah",
    "content": "Zaynab bint Khuzaymah was known as the Mother of the Poor. The Prophet married her after her husband was martyred. She died shortly afterward. Her marriage highlighted compassion for widows.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Marriage to Umm Salamah",
    "content": "Umm Salamah was a widow known for wisdom and patience. The Prophet married her after her husband’s death. She offered sound counsel on major occasions. Her narrations contributed to Islamic knowledge.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Gradual Legislation in Islam",
    "content": "Islamic laws were revealed gradually. This approach eased social change. Harmful customs were addressed step by step. Gradualism ensured long-term stability.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Economic Brotherhood System",
    "content": "Ansar shared homes and wealth with Muhajirun. Some offered half their property. This generosity prevented economic collapse. It demonstrated sincere faith.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Women in Early Islam",
    "content": "Women actively supported Islam. They participated in learning, migration, and nursing the wounded. Some pledged allegiance directly to the Prophet. Their role was publicly recognized.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Bay‘at an-Nisa’",
    "content": "Women pledged allegiance to the Prophet on moral and religious terms. This pledge excluded warfare obligations. It emphasized personal accountability. The pledge elevated women’s status.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Peaceful Resolution Preference",
    "content": "The Prophet consistently preferred peace when possible. Treaties and negotiations were prioritized. Warfare was defensive. Mercy was emphasized after victory.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Integration of Former Enemies",
    "content": "After the Conquest of Makkah, former enemies were integrated into society. Many became sincere Muslims. Leadership roles were assigned based on merit. This prevented cycles of revenge.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Distribution of Spoils at Hunayn",
    "content": "After Hunayn, the Prophet distributed wealth generously to new converts. This softened hearts and strengthened unity. Some Ansar initially felt concerned. The Prophet reassured them with wisdom.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Ethical Conduct in Warfare",
    "content": "The Prophet forbade harming non-combatants. He prohibited mutilation and treachery. Agreements were honored. These principles shaped Islamic military ethics.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Education as a Priority",
    "content": "Teaching Qur’an was prioritized from early Islam. Literacy was encouraged. Teachers were appointed. Knowledge became a pillar of the Muslim community.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Standardization of Community Practices",
    "content": "Prayer, fasting, charity, and pilgrimage unified Muslims. Common rituals replaced tribal customs. This standardization strengthened identity. Islam became a complete way of life.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Leadership Style of the Prophet",
    "content": "The Prophet led through consultation and humility. He participated in labor with companions. Decisions were often collective. Authority was exercised with mercy.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Consultation (Shura)",
    "content": "The Prophet consulted companions on major decisions. Examples include Uhud and the Trench. Opinions were respected. This established consultative governance.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Preparation of Successor Leadership",
    "content": "The Prophet emphasized unity before his death. He highlighted the importance of leadership continuity. Abu Bakr’s closeness was evident. The community was prepared for transition.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },

  {
    "topic": "Concept of Sacred Months",
    "content": "Arab society recognized four sacred months during which fighting was prohibited. These months facilitated safe travel and trade. Quraysh often manipulated these months to suit their interests. Islam later reaffirmed their sanctity and prohibited such manipulation.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Manipulation of Sacred Months (Nasī’)",
    "content": "Pre-Islamic Arabs practiced Nasī’, postponing sacred months to justify warfare. This practice benefited powerful tribes like Quraysh. Islam condemned Nasī’ as an act of disbelief. The Qur’an abolished this manipulation permanently.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Pre-Islamic Oaths and Vows",
    "content": "Arabs frequently swore oaths by idols, ancestors, or natural phenomena. These oaths were socially binding. Islam redirected oath-taking exclusively to Allah. False and excessive oaths were strongly discouraged.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Custom of Blood Revenge",
    "content": "Blood revenge was a central feature of Arab justice. Entire tribes were held responsible for individual crimes. Cycles of violence often lasted generations. Islam replaced this system with legal justice and forgiveness options.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Status of Orphans Before Islam",
    "content": "Orphans in pre-Islamic Arabia were often deprived of inheritance and protection. Guardians frequently misused their wealth. The Prophet’s own orphanhood highlighted this injustice. Islam introduced strict commands to protect orphans’ rights.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Pre-Islamic Forms of Marriage",
    "content": "Several types of marriage existed before Islam, including temporary unions and polyandrous arrangements. Women often had little consent or security. Islam abolished unjust forms and regulated marriage with clear rights and responsibilities. Nikah became a protected contract.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Treatment of Slaves in Arabia",
    "content": "Slaves were commonly mistreated and denied basic rights. They could be tortured or killed without consequence. Islam encouraged emancipation and humane treatment. Freeing slaves became an act of worship.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Economic Exploitation Through Usury",
    "content": "Usury was widespread in Makkah and surrounding regions. Debtors were often trapped in endless repayment cycles. Qurayshi elites profited heavily from interest-based loans. Islam strictly prohibited usury and restructured economic ethics.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Makkan Opposition Strategy Shift",
    "content": "When violence failed to stop Islam, Quraysh adopted social isolation and propaganda. They discouraged listening to Qur’anic recitation. Families were pressured to disown converts. These strategies still failed to halt the spread of Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Abu Lahab in Opposition",
    "content": "Abu Lahab persistently opposed the Prophet despite close kinship. He followed him to gatherings to undermine his message. Qur’anic revelation explicitly condemned him. His hostility exemplified ideological opposition within families.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Psychological Impact of Revelation on the Prophet",
    "content": "Early revelation placed immense emotional weight on the Prophet. He feared for himself after the first encounter with Gabriel. Khadijah reassured him and sought counsel from Waraqah ibn Nawfal. This support affirmed his prophethood.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Waraqah ibn Nawfal",
    "content": "Waraqah ibn Nawfal was a learned monotheist familiar with earlier scriptures. He confirmed that the revelation was from the same source as Moses. He predicted opposition against the Prophet. Waraqah died shortly thereafter.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Gradual Formation of Muslim Identity",
    "content": "Early Muslims developed a distinct identity through belief and practice. Separation from pagan rituals increased over time. Communal prayer and ethics reinforced unity. This identity transcended tribal divisions.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Use of Qur’anic Stories in Da‘wah",
    "content": "Makkan revelations frequently referenced earlier prophets. These stories emphasized patience, rejection, and eventual victory. They comforted the Prophet and believers. The narratives also warned Quraysh of consequences.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Early Muslim Demographics",
    "content": "The early Muslim community included youth, women, slaves, and nobles. This diversity challenged Qurayshi hierarchy. Islam appealed across social boundaries. Faith became the primary unifying factor.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Significance of the Cave of Thawr",
    "content": "During Hijrah, the Prophet and Abu Bakr hid in the Cave of Thawr. Qurayshi pursuers reached the cave entrance. Divine protection prevented their discovery. This event became a symbol of reliance on Allah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of ‘Abdullah ibn Abi Bakr in Hijrah",
    "content": "‘Abdullah ibn Abi Bakr gathered intelligence in Makkah during Hijrah. He reported Qurayshi movements nightly. His actions ensured safe planning. Intelligence played a critical role in migration success.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of ‘Amir ibn Fuhayrah",
    "content": "‘Amir ibn Fuhayrah tended sheep near the cave during Hijrah. This erased footprints of travelers. He later migrated to Madinah. His service demonstrated strategic support.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Guidance of ‘Abdullah ibn Urayqit",
    "content": "A non-Muslim guide, ‘Abdullah ibn Urayqit, was hired to guide the Hijrah route. He was trusted for his reliability. He guided them along an unconventional path. This reflected pragmatic decision-making.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Reception of the Prophet in Madinah",
    "content": "The people of Madinah welcomed the Prophet with joy. They recited poetry celebrating his arrival. Each family hoped to host him. His arrival marked a new era for the city.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Renaming of Yathrib to Madinah",
    "content": "After Hijrah, Yathrib became known as Madinah. The name reflected its transformation into a civil society. Religious and political leadership merged there. Madinah became the capital of the Muslim state.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Moral Reform in Madinan Society",
    "content": "Islam addressed long-standing social problems in Madinah. Tribal feuds were reconciled. Ethical conduct replaced revenge culture. The Prophet served as moral and political leader.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Masjid as Community Center",
    "content": "The mosque functioned beyond worship. It hosted education, judicial decisions, and diplomacy. Delegations were received there. The mosque embodied integrated leadership.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Education of Companions in Madinah",
    "content": "The Prophet taught companions regularly. Qur’an memorization was emphasized. Practical ethics accompanied instruction. Knowledge transmission became systematic.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Internal Security Challenges in Madinah",
    "content": "The Muslim community faced threats from hypocrites and hostile tribes. Intelligence and treaties addressed risks. Internal unity was maintained. Leadership balanced mercy and firmness.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Gradual Expansion of Muslim Influence",
    "content": "Islam spread beyond Madinah through preaching and alliances. Military expeditions secured routes. Neighboring tribes accepted Islam. The state expanded steadily.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Strategic Importance of Badr Route",
    "content": "Badr lay along major trade routes. Control of this area affected Qurayshi commerce. The battle shifted regional power balance. Muslims gained strategic confidence.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Lessons Derived from Uhud",
    "content": "Uhud demonstrated consequences of disobedience. Victory was linked to discipline. The setback strengthened moral resolve. Qur’anic verses addressed the incident directly.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Innovation of Trench Warfare",
    "content": "Digging a trench was unfamiliar to Arab warfare. Salman al-Farisi proposed the idea. It neutralized enemy cavalry. Strategic adaptation ensured Madinah’s survival.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Collapse of Confederates at the Trench",
    "content": "Allied forces suffered internal division. Severe weather worsened conditions. Morale collapsed. The siege ended without combat.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Shift of Power After the Trench",
    "content": "After the Trench, Quraysh lost initiative. Muslims moved from defense to offense. Regional balance shifted permanently. Islam emerged as dominant force.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Spiritual Discipline Through Fasting",
    "content": "Fasting strengthened community discipline. It fostered empathy for the poor. Collective worship increased unity. Ramadan became a defining spiritual period.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Concept of Ummah",
    "content": "Islam introduced the concept of a unified Ummah based on faith rather than lineage. This principle replaced tribal superiority with moral equality. Membership in the Ummah depended on belief and conduct. It reshaped political and social belonging in Arabia.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Redefinition of Honor and Nobility",
    "content": "Pre-Islamic honor was tied to ancestry and power. Islam redefined honor as righteousness and obedience to God. This shift challenged Qurayshi elitism. Moral character became the measure of worth.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Moral Discipline Through Prayer",
    "content": "The five daily prayers structured Muslim life. Prayer reinforced remembrance of God and moral accountability. Congregational prayer strengthened community bonds. It became a visible marker of Muslim identity.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Night Prayer of the Prophet",
    "content": "The Prophet regularly performed prolonged night prayers. This practice strengthened his spiritual resolve. Companions observed his devotion. Night prayer became a recommended act of worship.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Patience as a Core Virtue",
    "content": "Patience was repeatedly emphasized during persecution. Early Muslims were instructed to endure without retaliation. Qur’anic verses reinforced steadfastness. Patience became a defining moral trait.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Transformation of Leadership Ethics",
    "content": "Leadership in Islam was framed as responsibility, not privilege. The Prophet lived simply despite authority. He rejected personal wealth accumulation. This model influenced later Islamic governance.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Prophetic Mercy Toward Opponents",
    "content": "The Prophet consistently forgave personal offenses. Even severe enemies were shown mercy after victory. This approach softened resistance. Mercy became a hallmark of prophetic conduct.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Psychological Resilience of Early Muslims",
    "content": "Despite social pressure, early Muslims maintained strong conviction. Faith provided psychological strength. Communal worship reinforced resilience. Their endurance ensured survival of the message.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Use of Parables in Qur’anic Teaching",
    "content": "Qur’anic revelations used parables to convey moral truths. These stories were accessible to all audiences. They encouraged reflection rather than coercion. Teaching through parables enhanced understanding.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Rejection of Forced Conversion",
    "content": "Islam did not permit forced acceptance of faith. Invitation was based on clarity and choice. Treaties preserved religious freedom. This principle governed interactions with non-Muslims.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Protection of Religious Minorities",
    "content": "Jews and Christians under Muslim rule were granted protection. Their places of worship were respected. Agreements defined mutual obligations. This framework ensured coexistence.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Development of Islamic Legal Awareness",
    "content": "Legal principles emerged gradually through revelation. The Prophet judged disputes based on divine guidance. Fairness and evidence were emphasized. This laid foundations for Islamic jurisprudence.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Accountability of Leaders",
    "content": "The Prophet held governors and commanders accountable. Misconduct was corrected publicly when necessary. Authority was tied to responsibility. This discouraged abuse of power.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Ethics of Wealth Distribution",
    "content": "Wealth was viewed as a trust from God. Hoarding was discouraged. Charity purified wealth. Economic justice became a moral obligation.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Integration of Bedouin Tribes",
    "content": "Nomadic tribes gradually entered Islam. Education addressed their harsh customs. The Prophet showed patience toward their behavior. Over time, they adapted to Islamic norms.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of Delegations in Spreading Islam",
    "content": "Tribal delegations learned Islam directly from the Prophet. They returned as teachers to their people. This decentralized propagation. Islam spread rapidly across Arabia.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Standardization of Worship Practices",
    "content": "The Prophet taught uniform methods of prayer and rituals. Companions learned through observation. Consistency prevented fragmentation. Shared practice reinforced unity.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Moral Reform of Market Practices",
    "content": "Cheating and deception in trade were condemned. Honesty became a religious duty. Fair measurement was enforced. Ethical commerce strengthened trust.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Sanctity of Life in Islam",
    "content": "Human life was declared sacred. Unlawful killing was strictly forbidden. This principle countered tribal violence. Respect for life became central to Islamic ethics.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Reform of Funeral Practices",
    "content": "Islam replaced excessive mourning customs. Patience and prayer were encouraged. Grave worship was prohibited. Funerals became dignified and simple.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Care for the Poor and Needy",
    "content": "The Prophet prioritized care for the poor. Charity was organized and systematic. Social neglect was condemned. Compassion defined community ethics.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Respect for Labor and Work",
    "content": "Manual labor was honored in Islam. The Prophet worked alongside companions. Dependence without need was discouraged. Work became an act of dignity.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Reform of Inheritance Practices",
    "content": "Islam introduced defined inheritance shares. Women and orphans received rights. Arbitrary distribution was ended. Economic justice within families was established.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Ethical Use of Authority",
    "content": "The Prophet warned against misuse of authority. Leaders were servants of the people. Justice outweighed favoritism. Authority was bound by accountability to God.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Preservation of Trusts",
    "content": "Returning trusts was emphasized even toward enemies. The Prophet upheld this principle during Hijrah. Trustworthiness defined Islamic character. Social trust was restored.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Balance Between Spiritual and Worldly Life",
    "content": "Islam rejected monastic withdrawal. Worship and daily life were integrated. Family, work, and devotion were balanced. This created sustainable religious practice.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Final Emphasis on Unity",
    "content": "In his final days, the Prophet emphasized unity and avoidance of division. He warned against returning to tribal conflict. Brotherhood was reaffirmed. Unity preserved the Ummah after his passing.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Early Makkan Revelation Themes",
    "content": "Early Qur’anic revelations in Makkah focused on monotheism, the Hereafter, and moral accountability. They addressed the conscience rather than legal detail. Vivid descriptions of Paradise and Hell were frequent. These themes aimed to reform belief before law.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Qurayshi Fear of Social Disruption",
    "content": "Quraysh feared Islam would dismantle their social order. Tribal hierarchy and idol-based authority were threatened. They viewed monotheism as a political danger. This fear motivated intense opposition.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Mockery as a Tool of Opposition",
    "content": "Makkan leaders mocked the Prophet to discredit him publicly. They labeled him a poet, magician, or madman. These accusations aimed to discourage listening. Revelation consistently refuted these claims.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Qur’anic Challenge to Idol Worship",
    "content": "The Qur’an challenged the logic of idol worship. It questioned idols’ inability to create or benefit. Rational argument accompanied spiritual warning. This confrontation weakened pagan belief foundations.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Social Boycott of Banu Hashim",
    "content": "Quraysh enforced a boycott against Banu Hashim and Banu Muttalib. Marriage, trade, and social relations were cut off. The clans endured severe hardship. The boycott lasted about three years before collapsing.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Annulment of the Boycott Pact",
    "content": "The boycott document was hung in the Ka‘bah. Insects consumed it except for the name of Allah. This event led to its annulment. Internal Qurayshi dissent ended the embargo.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Year of Sorrow (عام الحزن)",
    "content": "The Prophet lost Khadijah and Abu Talib in the same year. Their deaths removed emotional and political support. This year was marked by deep grief. Opposition intensified afterward.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Journey to Ta’if",
    "content": "The Prophet traveled to Ta’if seeking support. Local leaders rejected him harshly. He was stoned and injured by townspeople. Despite this, he prayed for their guidance, not destruction.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Divine Consolation After Ta’if",
    "content": "After Ta’if, the Angel of the Mountains offered to destroy the town. The Prophet refused out of mercy. He hoped future generations would believe. This highlighted his compassion.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Meeting with Jinn at Nakhlah",
    "content": "A group of jinn listened to Qur’anic recitation at Nakhlah. They accepted Islam and returned to their people as callers. This event showed Islam’s universal reach. Revelation later referenced this incident.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Isra’ (Night Journey)",
    "content": "The Prophet was taken from Masjid al-Haram to Masjid al-Aqsa in one night. This journey was miraculous. It demonstrated divine support after hardship. It preceded the Mi‘raj.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Mi‘raj (Ascension to the Heavens)",
    "content": "During Mi‘raj, the Prophet ascended through the heavens. He met earlier prophets. The obligation of five daily prayers was established. This event affirmed his unique status.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Public Reaction to Isra’ and Mi‘raj",
    "content": "Many Quraysh mocked the account of the Night Journey. Some weak believers wavered. Abu Bakr immediately affirmed it. His unwavering faith earned him the title As-Siddiq.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Seasonal Da‘wah During Pilgrimage",
    "content": "The Prophet used pilgrimage seasons to preach Islam. He approached visiting tribes individually. Most rejected him due to Qurayshi pressure. Persistence eventually bore fruit.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "First Pledge of ‘Aqabah",
    "content": "Six men from Yathrib accepted Islam at ‘Aqabah. They pledged to worship Allah alone. This marked Islam’s entry into Yathrib. It laid groundwork for Hijrah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Second Pledge of ‘Aqabah",
    "content": "Seventy-three men and two women pledged allegiance to the Prophet. They promised protection and obedience. This was a political and military commitment. Hijrah was authorized afterward.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Appointment of Mus‘ab ibn ‘Umayr",
    "content": "Mus‘ab ibn ‘Umayr was sent to Yathrib as a teacher. He taught Qur’an and Islamic principles. Many leaders accepted Islam through him. His mission prepared Madinah for Hijrah.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Gradual Migration of Muslims",
    "content": "Muslims migrated to Madinah in small groups. Quraysh attempted to prevent departures. Some migrants left secretly. Migration strengthened the Madinan community.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Qurayshi Plot to Assassinate the Prophet",
    "content": "Quraysh leaders planned a collective assassination. Representatives from each clan were chosen. This aimed to avoid blood revenge. Divine revelation informed the Prophet of the plot.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Role of ‘Ali ibn Abi Talib During Hijrah",
    "content": "‘Ali slept in the Prophet’s bed during the assassination plot. He returned entrusted valuables to their owners. His courage ensured safe departure. This act showed integrity and sacrifice.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Establishment of Brotherhood (Mu’akhah)",
    "content": "The Prophet established brotherhood between Muhajirun and Ansar. This system ensured mutual support. Wealth and housing were shared. It eliminated economic disparity.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Drafting of the Madinah Charter",
    "content": "The Madinah Charter regulated relations among Muslims and Jews. It defined collective defense and justice. Religious freedom was guaranteed. It formed a constitutional framework.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Economic Struggles of the Muhajirun",
    "content": "Migrants arrived in Madinah with little wealth. Ansar assisted them generously. The Prophet encouraged lawful trade. Economic independence was gradually achieved.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  },
  {
    "topic": "Introduction of Adhan",
    "content": "The call to prayer was established in Madinah. ‘Abdullah ibn Zayd saw it in a dream. Bilal was chosen as the caller. Adhan became a public symbol of Islam.",
    "source": "Ar-Raheeq Al-Makhtum (The Sealed Nectar)"
  }
]
